MikroElektronika/core_packages/PIC/XC8/def/PIC18F8393/mcu.h
extern volatile __bit                   SE35                __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 SE35_bit            _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SE36>
extern volatile __bit                   SE36                __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 SE36_bit            _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SE37>
extern volatile __bit                   SE37                __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 SE37_bit            _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SE38>
extern volatile __bit                   SE38                __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 SE38_bit            _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SE39>
extern volatile __bit                   SE39                __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 SE39_bit            _BIT_ACCESS(LCDSE4,7)
// LCDSE0<SE4>
extern volatile __bit                   SE4                 __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 SE4_bit             _BIT_ACCESS(LCDSE0,4)
// LCDSE5<SE40>
extern volatile __bit                   SE40                __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 SE40_bit            _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SE41>
extern volatile __bit                   SE41                __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 SE41_bit            _BIT_ACCESS(LCDSE5,1)
// LCDSE5<SE42>
extern volatile __bit                   SE42                __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 SE42_bit            _BIT_ACCESS(LCDSE5,2)
// LCDSE5<SE43>
extern volatile __bit                   SE43                __at(0x7AFB);	// @ (0xF5F * 8 + 3)
#define                                 SE43_bit            _BIT_ACCESS(LCDSE5,3)
// LCDSE5<SE44>
extern volatile __bit                   SE44                __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 SE44_bit            _BIT_ACCESS(LCDSE5,4)
// LCDSE5<SE45>
extern volatile __bit                   SE45                __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 SE45_bit            _BIT_ACCESS(LCDSE5,5)
// LCDSE5<SE46>
extern volatile __bit                   SE46                __at(0x7AFE);	// @ (0xF5F * 8 + 6)
#define                                 SE46_bit            _BIT_ACCESS(LCDSE5,6)
// LCDSE5<SE47>
extern volatile __bit                   SE47                __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 SE47_bit            _BIT_ACCESS(LCDSE5,7)
// LCDSE0<SE5>
extern volatile __bit                   SE5                 __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 SE5_bit             _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE6>
extern volatile __bit                   SE6                 __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 SE6_bit             _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE7>
extern volatile __bit                   SE7                 __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 SE7_bit             _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE8>
extern volatile __bit                   SE8                 __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 SE8_bit             _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE9>
extern volatile __bit                   SE9                 __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 SE9_bit             _BIT_ACCESS(LCDSE1,1)
// PORTD<SEG0>
extern volatile __bit                   SEG0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 SEG0_bit            _BIT_ACCESS(PORTD,0)
// LCDDATA0<SEG0COM0>
extern volatile __bit                   SEG0COM0            __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 SEG0COM0_bit        _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<SEG0COM1>
extern volatile __bit                   SEG0COM1            __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 SEG0COM1_bit        _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<SEG0COM2>
extern volatile __bit                   SEG0COM2            __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 SEG0COM2_bit        _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<SEG0COM3>
extern volatile __bit                   SEG0COM3            __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 SEG0COM3_bit        _BIT_ACCESS(LCDDATA18,0)
// PORTD<SEG1>
extern volatile __bit                   SEG1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 SEG1_bit            _BIT_ACCESS(PORTD,1)
// PORTB<SEG10>
extern volatile __bit                   SEG10               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 SEG10_bit           _BIT_ACCESS(PORTB,3)
// LCDDATA1<SEG10COM0>
extern volatile __bit                   SEG10COM0           __at(0x7B0A);	// @ (0xF61 * 8 + 2)
#define                                 SEG10COM0_bit       _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<SEG10COM1>
extern volatile __bit                   SEG10COM1           __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 SEG10COM1_bit       _BIT_ACCESS(LCDDATA7,2)
// LCDDATA13<SEG10COM2>
extern volatile __bit                   SEG10COM2           __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 SEG10COM2_bit       _BIT_ACCESS(LCDDATA13,2)
// LCDDATA19<SEG10COM3>
extern volatile __bit                   SEG10COM3           __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 SEG10COM3_bit       _BIT_ACCESS(LCDDATA19,2)
// PORTB<SEG11>
extern volatile __bit                   SEG11               __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 SEG11_bit           _BIT_ACCESS(PORTB,4)
// LCDDATA1<SEG11COM0>
extern volatile __bit                   SEG11COM0           __at(0x7B0B);	// @ (0xF61 * 8 + 3)
#define                                 SEG11COM0_bit       _BIT_ACCESS(LCDDATA1,3)
// LCDDATA7<SEG11COM1>
extern volatile __bit                   SEG11COM1           __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 SEG11COM1_bit       _BIT_ACCESS(LCDDATA7,3)
// LCDDATA13<SEG11COM2>
extern volatile __bit                   SEG11COM2           __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 SEG11COM2_bit       _BIT_ACCESS(LCDDATA13,3)
// LCDDATA19<SEG11COM3>
extern volatile __bit                   SEG11COM3           __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 SEG11COM3_bit       _BIT_ACCESS(LCDDATA19,3)
// PORTC<SEG12>
extern volatile __bit                   SEG12               __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SEG12_bit           _BIT_ACCESS(PORTC,3)
// LCDDATA1<SEG12COM0>
extern volatile __bit                   SEG12COM0           __at(0x7B0C);	// @ (0xF61 * 8 + 4)
#define                                 SEG12COM0_bit       _BIT_ACCESS(LCDDATA1,4)
// LCDDATA7<SEG12COM1>
extern volatile __bit                   SEG12COM1           __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 SEG12COM1_bit       _BIT_ACCESS(LCDDATA7,4)
// LCDDATA13<SEG12COM2>
extern volatile __bit                   SEG12COM2           __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 SEG12COM2_bit       _BIT_ACCESS(LCDDATA13,4)
// LCDDATA19<SEG12COM3>
extern volatile __bit                   SEG12COM3           __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 SEG12COM3_bit       _BIT_ACCESS(LCDDATA19,4)
// PORTC<SEG13>
extern volatile __bit                   SEG13               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 SEG13_bit           _BIT_ACCESS(PORTC,2)
// LCDDATA1<SEG13COM0>
extern volatile __bit                   SEG13COM0           __at(0x7B0D);	// @ (0xF61 * 8 + 5)
#define                                 SEG13COM0_bit       _BIT_ACCESS(LCDDATA1,5)
// LCDDATA7<SEG13COM1>
extern volatile __bit                   SEG13COM1           __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 SEG13COM1_bit       _BIT_ACCESS(LCDDATA7,5)
// LCDDATA13<SEG13COM2>
extern volatile __bit                   SEG13COM2           __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 SEG13COM2_bit       _BIT_ACCESS(LCDDATA13,5)
// LCDDATA19<SEG13COM3>
extern volatile __bit                   SEG13COM3           __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 SEG13COM3_bit       _BIT_ACCESS(LCDDATA19,5)
// PORTA<SEG14>
extern volatile __bit                   SEG14               __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 SEG14_bit           _BIT_ACCESS(PORTA,4)
// LCDDATA1<SEG14COM0>
extern volatile __bit                   SEG14COM0           __at(0x7B0E);	// @ (0xF61 * 8 + 6)
#define                                 SEG14COM0_bit       _BIT_ACCESS(LCDDATA1,6)
// LCDDATA7<SEG14COM1>
extern volatile __bit                   SEG14COM1           __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 SEG14COM1_bit       _BIT_ACCESS(LCDDATA7,6)
// LCDDATA13<SEG14COM2>
extern volatile __bit                   SEG14COM2           __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 SEG14COM2_bit       _BIT_ACCESS(LCDDATA13,6)
// LCDDATA19<SEG14COM3>
extern volatile __bit                   SEG14COM3           __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 SEG14COM3_bit       _BIT_ACCESS(LCDDATA19,6)
// PORTA<SEG15>
extern volatile __bit                   SEG15               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 SEG15_bit           _BIT_ACCESS(PORTA,5)
// LCDDATA1<SEG15COM0>
extern volatile __bit                   SEG15COM0           __at(0x7B0F);	// @ (0xF61 * 8 + 7)
#define                                 SEG15COM0_bit       _BIT_ACCESS(LCDDATA1,7)
// LCDDATA7<SEG15COM1>
extern volatile __bit                   SEG15COM1           __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 SEG15COM1_bit       _BIT_ACCESS(LCDDATA7,7)
// LCDDATA13<SEG15COM2>
extern volatile __bit                   SEG15COM2           __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 SEG15COM2_bit       _BIT_ACCESS(LCDDATA13,7)
// LCDDATA19<SEG15COM3>
extern volatile __bit                   SEG15COM3           __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 SEG15COM3_bit       _BIT_ACCESS(LCDDATA19,7)
// PORTA<SEG16>
extern volatile __bit                   SEG16               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 SEG16_bit           _BIT_ACCESS(PORTA,2)
// LCDDATA2<SEG16COM0>
extern volatile __bit                   SEG16COM0           __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 SEG16COM0_bit       _BIT_ACCESS(LCDDATA2,0)
// LCDDATA8<SEG16COM1>
extern volatile __bit                   SEG16COM1           __at(0x7B40);	// @ (0xF68 * 8 + 0)
#define                                 SEG16COM1_bit       _BIT_ACCESS(LCDDATA8,0)
// LCDDATA14<SEG16COM2>
extern volatile __bit                   SEG16COM2           __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 SEG16COM2_bit       _BIT_ACCESS(LCDDATA14,0)
// LCDDATA20<SEG16COM3>
extern volatile __bit                   SEG16COM3           __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 SEG16COM3_bit       _BIT_ACCESS(LCDDATA20,0)
// PORTA<SEG17>
extern volatile __bit                   SEG17               __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 SEG17_bit           _BIT_ACCESS(PORTA,3)
// LCDDATA2<SEG17COM0>
extern volatile __bit                   SEG17COM0           __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 SEG17COM0_bit       _BIT_ACCESS(LCDDATA2,1)
// LCDDATA8<SEG17COM1>
extern volatile __bit                   SEG17COM1           __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 SEG17COM1_bit       _BIT_ACCESS(LCDDATA8,1)
// LCDDATA14<SEG17COM2>
extern volatile __bit                   SEG17COM2           __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 SEG17COM2_bit       _BIT_ACCESS(LCDDATA14,1)
// LCDDATA20<SEG17COM3>
extern volatile __bit                   SEG17COM3           __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 SEG17COM3_bit       _BIT_ACCESS(LCDDATA20,1)
// PORTF<SEG18>
extern volatile __bit                   SEG18               __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 SEG18_bit           _BIT_ACCESS(PORTF,0)
// LCDDATA2<SEG18COM0>
extern volatile __bit                   SEG18COM0           __at(0x7B12);	// @ (0xF62 * 8 + 2)
#define                                 SEG18COM0_bit       _BIT_ACCESS(LCDDATA2,2)
// LCDDATA8<SEG18COM1>
extern volatile __bit                   SEG18COM1           __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 SEG18COM1_bit       _BIT_ACCESS(LCDDATA8,2)
// LCDDATA14<SEG18COM2>
extern volatile __bit                   SEG18COM2           __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 SEG18COM2_bit       _BIT_ACCESS(LCDDATA14,2)
// LCDDATA20<SEG18COM3>
extern volatile __bit                   SEG18COM3           __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 SEG18COM3_bit       _BIT_ACCESS(LCDDATA20,2)
// PORTF<SEG19>
extern volatile __bit                   SEG19               __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 SEG19_bit           _BIT_ACCESS(PORTF,1)
// LCDDATA2<SEG19COM0>
extern volatile __bit                   SEG19COM0           __at(0x7B13);	// @ (0xF62 * 8 + 3)
#define                                 SEG19COM0_bit       _BIT_ACCESS(LCDDATA2,3)
// LCDDATA8<SEG19COM1>
extern volatile __bit                   SEG19COM1           __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 SEG19COM1_bit       _BIT_ACCESS(LCDDATA8,3)
// LCDDATA14<SEG19COM2>
extern volatile __bit                   SEG19COM2           __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 SEG19COM2_bit       _BIT_ACCESS(LCDDATA14,3)
// LCDDATA20<SEG19COM3>
extern volatile __bit                   SEG19COM3           __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 SEG19COM3_bit       _BIT_ACCESS(LCDDATA20,3)
// LCDDATA0<SEG1COM0>
extern volatile __bit                   SEG1COM0            __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 SEG1COM0_bit        _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<SEG1COM1>
extern volatile __bit                   SEG1COM1            __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 SEG1COM1_bit        _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<SEG1COM2>
extern volatile __bit                   SEG1COM2            __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 SEG1COM2_bit        _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<SEG1COM3>
extern volatile __bit                   SEG1COM3            __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 SEG1COM3_bit        _BIT_ACCESS(LCDDATA18,1)
// PORTD<SEG2>
extern volatile __bit                   SEG2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 SEG2_bit            _BIT_ACCESS(PORTD,2)
// PORTF<SEG20>
extern volatile __bit                   SEG20               __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 SEG20_bit           _BIT_ACCESS(PORTF,2)
// LCDDATA2<SEG20COM0>
extern volatile __bit                   SEG20COM0           __at(0x7B14);	// @ (0xF62 * 8 + 4)
#define                                 SEG20COM0_bit       _BIT_ACCESS(LCDDATA2,4)
// LCDDATA8<SEG20COM1>
extern volatile __bit                   SEG20COM1           __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 SEG20COM1_bit       _BIT_ACCESS(LCDDATA8,4)
// LCDDATA14<SEG20COM2>
extern volatile __bit                   SEG20COM2           __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 SEG20COM2_bit       _BIT_ACCESS(LCDDATA14,4)
// LCDDATA20<SEG20COM3>
extern volatile __bit                   SEG20COM3           __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 SEG20COM3_bit       _BIT_ACCESS(LCDDATA20,4)
// PORTF<SEG21>
extern volatile __bit                   SEG21               __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 SEG21_bit           _BIT_ACCESS(PORTF,3)
// LCDDATA2<SEG21COM0>
extern volatile __bit                   SEG21COM0           __at(0x7B15);	// @ (0xF62 * 8 + 5)
#define                                 SEG21COM0_bit       _BIT_ACCESS(LCDDATA2,5)
// LCDDATA8<SEG21COM1>
extern volatile __bit                   SEG21COM1           __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 SEG21COM1_bit       _BIT_ACCESS(LCDDATA8,5)
// LCDDATA14<SEG21COM2>
extern volatile __bit                   SEG21COM2           __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 SEG21COM2_bit       _BIT_ACCESS(LCDDATA14,5)
// LCDDATA20<SEG21COM3>
extern volatile __bit                   SEG21COM3           __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 SEG21COM3_bit       _BIT_ACCESS(LCDDATA20,5)
// PORTF<SEG22>
extern volatile __bit                   SEG22               __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 SEG22_bit           _BIT_ACCESS(PORTF,4)
// LCDDATA2<SEG22COM0>
extern volatile __bit                   SEG22COM0           __at(0x7B16);	// @ (0xF62 * 8 + 6)
#define                                 SEG22COM0_bit       _BIT_ACCESS(LCDDATA2,6)
// LCDDATA8<SEG22COM1>
extern volatile __bit                   SEG22COM1           __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 SEG22COM1_bit       _BIT_ACCESS(LCDDATA8,6)
// LCDDATA14<SEG22COM2>
extern volatile __bit                   SEG22COM2           __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 SEG22COM2_bit       _BIT_ACCESS(LCDDATA14,6)
// LCDDATA20<SEG22COM3>
extern volatile __bit                   SEG22COM3           __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 SEG22COM3_bit       _BIT_ACCESS(LCDDATA20,6)
// PORTF<SEG23>
extern volatile __bit                   SEG23               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 SEG23_bit           _BIT_ACCESS(PORTF,5)
// LCDDATA2<SEG23COM0>
extern volatile __bit                   SEG23COM0           __at(0x7B17);	// @ (0xF62 * 8 + 7)
#define                                 SEG23COM0_bit       _BIT_ACCESS(LCDDATA2,7)
// LCDDATA8<SEG23COM1>
extern volatile __bit                   SEG23COM1           __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 SEG23COM1_bit       _BIT_ACCESS(LCDDATA8,7)
// LCDDATA14<SEG23COM2>
extern volatile __bit                   SEG23COM2           __at(0x7B9F);	// @ (0xF73 * 8 + 7)
#define                                 SEG23COM2_bit       _BIT_ACCESS(LCDDATA14,7)
// LCDDATA20<SEG23COM3>
extern volatile __bit                   SEG23COM3           __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 SEG23COM3_bit       _BIT_ACCESS(LCDDATA20,7)
// PORTF<SEG24>
extern volatile __bit                   SEG24               __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 SEG24_bit           _BIT_ACCESS(PORTF,6)
// LCDDATA3<SEG24COM0>
extern volatile __bit                   SEG24COM0           __at(0x7B18);	// @ (0xF63 * 8 + 0)
#define                                 SEG24COM0_bit       _BIT_ACCESS(LCDDATA3,0)
// LCDDATA9<SEG24COM1>
extern volatile __bit                   SEG24COM1           __at(0x7B48);	// @ (0xF69 * 8 + 0)
#define                                 SEG24COM1_bit       _BIT_ACCESS(LCDDATA9,0)
// LCDDATA15<SEG24COM2>
extern volatile __bit                   SEG24COM2           __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 SEG24COM2_bit       _BIT_ACCESS(LCDDATA15,0)
// LCDDATA21<SEG24COM3>
extern volatile __bit                   SEG24COM3           __at(0x7BD0);	// @ (0xF7A * 8 + 0)
#define                                 SEG24COM3_bit       _BIT_ACCESS(LCDDATA21,0)
// PORTF<SEG25>
extern volatile __bit                   SEG25               __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 SEG25_bit           _BIT_ACCESS(PORTF,7)
// LCDDATA3<SEG25COM0>
extern volatile __bit                   SEG25COM0           __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 SEG25COM0_bit       _BIT_ACCESS(LCDDATA3,1)
// LCDDATA9<SEG25COM1>
extern volatile __bit                   SEG25COM1           __at(0x7B49);	// @ (0xF69 * 8 + 1)
#define                                 SEG25COM1_bit       _BIT_ACCESS(LCDDATA9,1)
// LCDDATA15<SEG25COM2>
extern volatile __bit                   SEG25COM2           __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 SEG25COM2_bit       _BIT_ACCESS(LCDDATA15,1)
// LCDDATA21<SEG25COM3>
extern volatile __bit                   SEG25COM3           __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 SEG25COM3_bit       _BIT_ACCESS(LCDDATA21,1)
// PORTG<SEG26>
extern volatile __bit                   SEG26               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 SEG26_bit           _BIT_ACCESS(PORTG,4)
// LCDDATA3<SEG26COM0>
extern volatile __bit                   SEG26COM0           __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 SEG26COM0_bit       _BIT_ACCESS(LCDDATA3,2)
// LCDDATA9<SEG26COM1>
extern volatile __bit                   SEG26COM1           __at(0x7B4A);	// @ (0xF69 * 8 + 2)
#define                                 SEG26COM1_bit       _BIT_ACCESS(LCDDATA9,2)
// LCDDATA15<SEG26COM2>
extern volatile __bit                   SEG26COM2           __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 SEG26COM2_bit       _BIT_ACCESS(LCDDATA15,2)
// LCDDATA21<SEG26COM3>
extern volatile __bit                   SEG26COM3           __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 SEG26COM3_bit       _BIT_ACCESS(LCDDATA21,2)
// PORTG<SEG27>
extern volatile __bit                   SEG27               __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 SEG27_bit           _BIT_ACCESS(PORTG,3)
// LCDDATA3<SEG27COM0>
extern volatile __bit                   SEG27COM0           __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 SEG27COM0_bit       _BIT_ACCESS(LCDDATA3,3)
// LCDDATA9<SEG27COM1>
extern volatile __bit                   SEG27COM1           __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 SEG27COM1_bit       _BIT_ACCESS(LCDDATA9,3)
// LCDDATA15<SEG27COM2>
extern volatile __bit                   SEG27COM2           __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 SEG27COM2_bit       _BIT_ACCESS(LCDDATA15,3)
// LCDDATA21<SEG27COM3>
extern volatile __bit                   SEG27COM3           __at(0x7BD3);	// @ (0xF7A * 8 + 3)
#define                                 SEG27COM3_bit       _BIT_ACCESS(LCDDATA21,3)
// PORTG<SEG28>
